#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```hcl
module.networking.data.aws_availability_zones.available: Reading...
module.networking.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0722b6f0159165981]
module.networking.aws_vpc.main: Refreshing state... [id=vpc-0f25dedb0cb63b77d]
module.s3.aws_s3_bucket.static: Refreshing state... [id=three-tier-577932]
module.networking.data.aws_availability_zones.available: Read complete after 0s [id=us-east-1]
module.s3.aws_s3_bucket_public_access_block.static: Refreshing state... [id=three-tier-577932]
module.networking.aws_subnet.private[1]: Refreshing state... [id=subnet-087aa123bcd5fe495]
module.networking.aws_internet_gateway.main: Refreshing state... [id=igw-010faf18f074af819]
module.networking.aws_subnet.public[1]: Refreshing state... [id=subnet-0768f06f4ffc721a9]
module.networking.aws_subnet.private[0]: Refreshing state... [id=subnet-0eba37165395d524f]
module.security.aws_security_group.alb: Refreshing state... [id=sg-079076fa9fcf5799b]
module.networking.aws_subnet.public[0]: Refreshing state... [id=subnet-03aae1094690833bb]
module.ec2.aws_lb_target_group.web: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:891377355146:targetgroup/web-tg/1896e229535105d6]
module.networking.aws_route_table.public: Refreshing state... [id=rtb-0dce72b75e7b5d424]
module.rds.aws_db_subnet_group.default: Refreshing state... [id=main]
module.security.aws_security_group.web: Refreshing state... [id=sg-067fe14a937f3796a]
module.networking.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0337c79fdcc0e9540]
module.networking.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-01fb32d95543be13a]
module.networking.aws_nat_gateway.main: Refreshing state... [id=nat-00fd81fe62f35f85a]
module.ec2.aws_lb.web: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:891377355146:loadbalancer/app/web-alb/47324693bf243419]
module.security.aws_security_group.db: Refreshing state... [id=sg-0ac96d3129928cebc]
module.ec2.aws_launch_template.web: Refreshing state... [id=lt-045a1ca22c18c5a2d]
module.networking.aws_route_table.private: Refreshing state... [id=rtb-072bf82decf370130]
module.networking.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0a4ae8fb650625966]
module.networking.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-08076f3a999b8c634]
module.ec2.aws_autoscaling_group.web: Refreshing state... [id=terraform-20241007212241510000000003]
module.ec2.aws_lb_listener.web: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:891377355146:listener/app/web-alb/47324693bf243419/eedad16e5ce356ba]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.rds.aws_db_instance.default will be created
  + resource "aws_db_instance" "default" {
      + address                               = (known after apply)
      + allocated_storage                     = 10
      + apply_immediately                     = false
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = true
      + availability_zone                     = (known after apply)
      + backup_retention_period               = (known after apply)
      + backup_window                         = (known after apply)
      + ca_cert_identifier                    = (known after apply)
      + character_set_name                    = (known after apply)
      + copy_tags_to_snapshot                 = false
      + db_name                               = "myapp"
      + db_subnet_group_name                  = "main"
      + delete_automated_backups              = true
      + endpoint                              = (known after apply)
      + engine                                = "mysql"
      + engine_version                        = "8.0"
      + engine_version_actual                 = (known after apply)
      + hosted_zone_id                        = (known after apply)
      + id                                    = (known after apply)
      + identifier                            = (known after apply)
      + identifier_prefix                     = (known after apply)
      + instance_class                        = "db.t3.micro"
      + iops                                  = (known after apply)
      + kms_key_id                            = (known after apply)
      + latest_restorable_time                = (known after apply)
      + license_model                         = (known after apply)
      + listener_endpoint                     = (known after apply)
      + maintenance_window                    = (known after apply)
      + master_user_secret                    = (known after apply)
      + master_user_secret_kms_key_id         = (known after apply)
      + monitoring_interval                   = 0
      + monitoring_role_arn                   = (known after apply)
      + multi_az                              = (known after apply)
      + name                                  = (known after apply)
      + nchar_character_set_name              = (known after apply)
      + network_type                          = (known after apply)
      + option_group_name                     = (known after apply)
      + parameter_group_name                  = "default.mysql8.0"
      + password                              = (sensitive value)
      + performance_insights_enabled          = false
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = (known after apply)
      + port                                  = (known after apply)
      + publicly_accessible                   = false
      + replica_mode                          = (known after apply)
      + replicas                              = (known after apply)
      + resource_id                           = (known after apply)
      + skip_final_snapshot                   = true
      + snapshot_identifier                   = (known after apply)
      + status                                = (known after apply)
      + storage_throughput                    = (known after apply)
      + storage_type                          = (known after apply)
      + tags_all                              = (known after apply)
      + timezone                              = (known after apply)
      + username                              = "admin"
      + vpc_security_group_ids                = [
          + "sg-0ac96d3129928cebc",
        ]
    }

  # module.s3.aws_s3_bucket_acl.static will be created
  + resource "aws_s3_bucket_acl" "static" {
      + acl    = "public-read"
      + bucket = "three-tier-577932"
      + id     = (known after apply)

      + access_control_policy (known after apply)
    }

  # module.s3.aws_s3_bucket_ownership_controls.static will be created
  + resource "aws_s3_bucket_ownership_controls" "static" {
      + bucket = "three-tier-577932"
      + id     = (known after apply)

      + rule {
          + object_ownership = "BucketOwnerPreferred"
        }
    }

  # module.s3.aws_s3_bucket_policy.static will be created
  + resource "aws_s3_bucket_policy" "static" {
      + bucket = "three-tier-577932"
      + id     = (known after apply)
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "s3:GetObject"
                      + Effect    = "Allow"
                      + Principal = "*"
                      + Resource  = "arn:aws:s3:::three-tier-577932/*"
                      + Sid       = "PublicReadGetObject"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
    }

Plan: 4 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + rds_endpoint   = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @Jothamcloud, Action: `pull_request`*